# Topic 1. 주제 고도화

조금 더 구체적인 프로젝트 목표 및 내용 설정

## 1. 주제 선정

### 주제 선정 시 고려해야 할 사항

1. 시간 내로 구현할 수 있는 주제인가? (난도)
2. SW 역량을 충분히 발휘하고 적용할 수 있는 주제인가? (웹/앱 이용한 서비스화 가능 여부)
3. 기존에 없던 새로운 아이디어인가? (창의성)
혹은 종래의 솔루션에서 개선된 점을 구체적으로 기술할 수 있는가?

### 후보 1. 스마트 자전거 잠금 시스템 개발

- 프레임과 바퀴를 모두 고정시키는 잠금장치
- 스마트폰과 연동해서 잠금 해제.
- **TODO:: 종래의 솔루션과의 차별점과 개선점을 명시할 수 있어야 함**

### 후보 2. 실내 인원 계수 시스템 개발

- 인원 계수 정보가 필요한 실내환경에서 복잡한 장비 대신 간단한 방법으로 인원을 계수할 수 있는 시스템 또는 알고리즘 개발
- **TODO:: 인원 계수 방법에 대한 고민**
    1. 적외선 센서 2개를 안쪽과 바깥쪽에 장착 후 계수
        - 간단한 방법이나 2인 이상의 중복인원 출입 가능
    2. 적외선 센서 1개를 이용, 카메라 센서 장착 후 계수
        - 적외선 센서로 출입을 감지, 카메라 센서 작동, 객체 인식 후 트래킹, 출입 구분
- **TODO:: 인원 계수 후 제공해야 하는 서비스에 대한 고민**
    - 단순 인원 계수만으로는 목적성이 너무 없음.
    - 구체적인 서비스 (i.e. 코로나 대비 etc...)를 생각하지 않으면
    인원 계수를 정확히 할지, 허용 오차를 두고 혼잡도로 계산할지,
    인원 계수 말고 면적으로 계산할지 등을 정할 수 없다.

---

## 2. 요약 문서 작성

### 1. 과제 개요

### 2. 과제 수행 목표 및 필요성

1. 개발 동기
2. 개발 목적 및 목표
3. 개발 필요성

### 3. 과제 추진 내용

예상 구현과정 (개념 설계, 상세 설계(아직은 시기상조), 구현 방법 등)

### 4. R&R (Role & Responsibility)
